AFX_GLOBAL_DATA.D2D1MakeRotateMatrix(System.Single,D2D_POINT_2F,D2D_MATRIX_3X2_F*)
Creates a rotation transformation that rotates by the specified angle about the specified point.
Returns: Returns S_OK if successful, or an error value otherwise.
angle: The clockwise rotation angle, in degrees.
center: The point about which to rotate.
matrix: When this method returns, contains the new rotation transformation. You must allocate storage for this parameter.

AFX_GLOBAL_DATA.GetWICFactory
Returns a pointer to IWICImagingFactory interface stored in the global data. If this interface is not initialized yet, it will be created with the default parameters.
Returns: A pointer to IWICImagingFactory interface if creation of a factory succeeds, or NULL if creation fails or current
Operation System don't have WIC support.

AFX_GLOBAL_DATA.GetWriteFactory
Returns a pointer to IDWriteFactory interface stored in the global data. If this interface is not initialized yet, it will be created with the default parameters.
Returns: A pointer to IDWriteFactory interface if creation of a factory succeeds, or NULL if creation fails or current
Operation System don't have DirectWrite support.

AFX_GLOBAL_DATA.GetDirect2dFactory
Returns a pointer to ID2D1Factory interface stored in the global data. If this interface is not initialized yet, it will be created with the default parameters.
Returns: A pointer to ID2D1Factory interface if creation of a factory succeeds, or NULL if creation fails or current
Operation System don't have D2D support.

AFX_GLOBAL_DATA.IsD2DInitialized
Determines whether the D2D was initialized
Returns:
TRUE if D2D was initialized; otherwise FALSE.

AFX_GLOBAL_DATA.InitD2D(D2D1_FACTORY_TYPE,DWRITE_FACTORY_TYPE)
Initializes D2D, DirectWrite and WIC factories. This method should be called prior to initialization of the main window .
Returns:
Returns TRUE if the factories were intilalizrd, FALSE - otherwise
d2dFactoryType: The threading model of the D2D factory and the resources it creates.
writeFactoryType: A value that specifies whether the write factory object will be shared or isolated